tutorials/incompressibleVoF/containerDischarge2D/0/alpha.liquid
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alpha.liquid;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [];

internalField
{
    type        zonal;

    defaultValue    0;

    zones
    {
        liquid
        {
            type            box;

            box             (-100 -100 0.0) (100 100 0.05);

            value           1;
        }
    }
}

boundaryField
{
    "(left|right|atmosphere)"
    {
        type            inletOutlet;
        inletValue      uniform 0;
    }

    wall
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
